//******************************************************************************
//
// The information in this file is intended mainly for debug purposes, and to
// make it possible to locate files with particular characteristics.  The
// content is as follows :-
//
// * A number of elements come in pairs -- Xxx and HasXxx.  In these cases,
//   Xxx is a list, and HasXxx is true if Xxx is non-empty.  The HasXxx
//   in these cases are intended to make it slightly easier to search for texts
//   with the corresponding characteristics.  (Some HasXxx elements are not
//   paired with lists, but simply indicate that a particular characteristic is
//   or is not present.)
//
// * ModuleName: What it says on the tin.
//
// * VersificationScheme: Again, what it says on the tin.  Will be NRSV(A)
//   on reversified texts.  Otherwise, it is whatever you specified on the
//   command line.
//
// * HasCrossReferences is true if the text contains ref tags or char:xt tags.
//   I do not (presently) record here any details of cross-references which
//   don't work for any reason.
//
// * HasFootnotes is true if the text contains note:f, note:ef or note:fe.
//
// * HasElisions / AllElisionLocations: All ElisionLocations lists the locations
//   of _all_ elisions, regardless of flavour (see below to make sense of that).
//   HasElisions is true if AllElisionLocations is non-empty.
//
// * HasElidedSubverses / SubverseElisionLocations: SubverseElisionLocations the
//   locations of all places where the start and end of an elision are both
//   subverses, and HasElidedSubverses is true if the list is non-empty.  Note
//   that at present, I don't check that the start and end locations are in the
//   same verse (or not for purposes of reporting here: the code at large may well
//   do so).  SubverseElisionLocations will be a possibly empty subset of
//   AllElisionLocations.
//
// * HasMismatchedVerseSubverseElisions/MismatchedVerseSubverseElisionLocations:
//   MismatchedVerseSubverseElisionLocations lists all places where an elision
//   starts with a verse and ends with a subverse or vice versa, and
//   HasMismatchedVerseSubverseElisions is true if this collection is non-empty.
//   MismatchedVerseSubverseElisionLocations will be a possibly empty subset of
//   AllElisionLocations.
//
// * HasTables / TableLocations: TableLocations lists the locations of all tables.
//   HasTables will be true if TableLocations is non-empty.
//
// * HasSpeakers / SpeakerLocations: SpeakerLocations lists the locations of all
//   speaker markup.  HasSpeakers will be true if SpeakerLocations is non-empty.
//
// * ReversificationType: None, Basic, or Academic.
//
// * HasReversificationDataIssues / ReversificationDataIssues:
//   ReversificationDataIssues lists any issues found while processing the
//   reversification.  (In particular, it lists reversification rows whose
//   applicability could not be determined because they used rules which
//   attempted to apply length tests to elided verses.)
//   HasReversificationDataIssues is true of any data issues have been recorded.
//
// * ReversificationMappings: Where reversification has been applied, this lists
//   old-to-new reference mappings where old and new are different.
//
// * AcceptedVersificationRows: Lists all of the applicable versification rows.
//
// * TagNamesInRawUsx: What it says on the tin: a full list of tag names.
//
//******************************************************************************
{
  "ModuleName": "NETSLXX",
  "VersificationScheme": "NRSVA",
  "HasCrossReferences": false,
  "HasFootnotes": true,
  "HasElisions": false,
  "AllElisionLocations": [],
  "HasElidedSubverses": false,
  "SubverseElisionLocations": [],
  "HasMismatchedVerseSubverseElisions": false,
  "MismatchedVerseSubverseElisionLocations": [],
  "HasTables": false,
  "TableLocations": [],
  "HasSpeakers": false,
  "SpeakerLocations": [],
  "ReversificationType": "none",
  "HasReversificationDataIssues": false,
  "TagNamesInRawUsx": [
    "#document",
    "#text",
    "book",
    "chapter",
    "char:fr",
    "char:ft",
    "note:f",
    "para:ide",
    "para:p",
    "usx",
    "verse"
  ]
}
